Revit 2027 API
DocumentValidation.CanDeleteElement Method
 Indicates if an element can be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanDeleteElement(
	Document document,
	ElementId elementId
)
Public Shared Function CanDeleteElement (
	document As Document,
	elementId As ElementId
) As Boolean
public:
static bool CanDeleteElement(
	Document^ document,
	ElementId^ elementId
)
static member CanDeleteElement :
        document : Document *
        elementId : ElementId -> bool
Parameters
document Document
 The document.
elementId ElementId
 The id of the element to check.
Return Value
Boolean
 True if the element can be deleted, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DocumentValidation Class
Autodesk.Revit.DB Namespace